'''
print('Hello, World! ')


# input - это функция ввода информации
name = input('Hello, what is your name? ')

# print - это функция вывода информации 
print(f'Hello, {name}! Welcome to Python Programming!')
'''
'''
Типы данных в Python:
1. int - целые числа (например, 1, 2, 3)
2. float - числа с плавающей точкой (например, 1.5, 3.14)
3. str - строки (например, 'Hello', "World")
4. bool - логические значения (True, False)
5. list - списки (например, [1, 2, 3], ['a', 'b', 'c'])
6. tuple - кортежи (например, (1, 2, 3), ('a', 'b', 'c'))
7. dict - словари (например, {'name': 'Alice', 'age': 30})
8. set - множества (например, {1, 2, 3}, {'a', 'b', 'c'})

'''
# ОПЕРАТОРЫ СРАВНЕНИЯ

# Операторы сравнения:
# == (равно)
# != (не равно)
# > (больше)
# < (меньше)
# >= (больше или равно)
# <= (меньше или равно)
# = (присваивание)

# Логические операторы:


# and (логическое И)
# or (логическое ИЛИ)
# not (логическое НЕ)


# условные конструкции (ВЕТВЛЕНИЯ)

# if - условие
# elif - иначе если
# else - иначе

'''
temperature = int(input('Введите температуру: '))

if temperature > 25:
    print('Сейчас жарко.')
    
elif temperature < 10:
    print('Сейчас холодно.')
else:
    print('Сейчас тепло.')
'''


'''
Самый простой пример

if условие:
    блок кода, который выполняется, если условие истинно

    Пример по сложнее

if условие1:
    блок кода, который выполняется, если условие1 истинно

else условие2:
    блок кода, который выполняется, если условие2 истинно

     Самый сложный пример

if условие1:
    блок кода, который выполняется, если условие1 истинно
elif условие2:
    блок кода, который выполняется, если условие2 истинно
else:
    блок кода, который выполняется, если ни одно из условий не истинно    
'''











